burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADON</name>
              <description>desc ADON</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ADON</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Temperature sensor and VREFINT disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Temperature sensor and VREFINT enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONT</name>
              <description>desc CONT</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>CONT</name>
                <enumeratedValue>
                  <name>Single</name>
                  <description>Single conversion mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Continuous</name>
                  <description>Continuous conversion mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAL</name>
              <description>desc CAL</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>CALR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Complete</name>
                  <description>Calibration complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enabled calibration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>CALW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>StartCalibration</name>
                  <description>Start calibration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTCAL</name>
              <description>desc RSTCAL</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>RSTCALR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>IsInitialized</name>
                  <description>Calibration register is initialized</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Initialized</name>
                  <description>Calibration register initialized</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>RSTCALW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Calibration reset enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>desc DMA</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>DMA</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Temperature sensor and VREFINT disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Temperature sensor and VREFINT enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALIGN</name>
              <description>desc ALIGN</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>ALIGN</name>
                <enumeratedValue>
                  <name>Right</name>
                  <description>Right-aligned</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Left</name>
                  <description>Left-aligned</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>desc JEXTSEL</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues>
                <name>JEXTSEL</name>
                <enumeratedValue>
                  <name>Timer1Trgo</name>
                  <description>Timer1 TRGO event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer1Ch4</name>
                  <description>Timer1 Channel 4 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer2Trgo</name>
                  <description>Timer2 TRGO event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer2Ch1</name>
                  <description>Timer2 Channel 1 event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer3Trgo</name>
                  <description>Timer3 TRGO event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer15Trgo</name>
                  <description>Timer15 TRGO event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exti15</name>
                  <description>EXTI15 event</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Jswstart</name>
                  <description>JSWSTART event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEXTTRIG</name>
              <description>desc JEXTTRIG</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>JEXTTRIG</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Temperature sensor and VREFINT disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Temperature sensor and VREFINT enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTSEL</name>
              <description>desc EXTSEL</description>
              <bitRange>[19:17]</bitRange>
              <enumeratedValues>
                <name>EXTSEL</name>
                <enumeratedValue>
                  <name>Timer1Ch1</name>
                  <description>Timer1 Channel 1 event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer1Ch2</name>
                  <description>Timer1 Channel 2 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer1Ch3</name>
                  <description>Timer1 Channel 3 event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer2Ch2</name>
                  <description>Timer2 Channel 2 event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer3Trgo</name>
                  <description>Timer3 TRGO event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Timer15Trgo</name>
                  <description>Timer15 TRGO event</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exti11</name>
                  <description>EXTI11 event</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Swstart</name>
                  <description>SWSTART event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTTRIG</name>
              <description>desc EXTTRIG</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues>
                <name>EXTTRIG</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>External triggering of rule channel disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>External triggering of rule channel enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSWSTART</name>
              <description>desc JSWSTART</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues>
                <name>JSWSTARTR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Injection channel conversion reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>Injection channel conversion started</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>JSWSTARTW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>StartConversion</name>
                  <description>Start injection channel conversion</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWSTART</name>
              <description>desc SWSTART</description>
              <bitRange>[22:22]</bitRange>
              <enumeratedValues>
                <name>SWSTARTR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Rule channel conversion reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Start</name>
                  <description>Rule channel conversion started</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>SWSTARTW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>StartConversion</name>
                  <description>Start rule channel conversion</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSVREFE</name>
              <description>desc TSVREFE</description>
              <bitRange>[23:23]</bitRange>
              <enumeratedValues>
                <name>TSVREFE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Temperature sensor and VREFINT disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Temperature sensor and VREFINT enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFBUF</name>
              <description>desc VERFBUFFERE</description>
              <bitRange>[25:25]</bitRange>
              <enumeratedValues>
                <name>VREFBUF</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable VREFBUF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable VREFBUF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VREFBUFFSEL</name>
              <description>desc VERFBUFFERSEL</description>
              <bitRange>[27:26]</bitRange>
              <enumeratedValues>
                <name>VREFBUFFSEL</name>
                <enumeratedValue>
                  <name>OV1_5</name>
                  <description>1.5V VREFBUF output voltage</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OV2_048</name>
                  <description>2.048V VREFBUF output voltage</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OV2_5</name>
                  <description>2.5V VREFBUF output voltage</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>desc SMPR1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SMP20</name>
              <description>desc SMP20</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>SMP20</name>
                <enumeratedValue>
                  <name>Cycles3_5</name>
                  <description>3.5 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles5_5</name>
                  <description>5.5 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles7_5</name>
                  <description>7.5 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles13_5</name>
                  <description>13.5 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP21</name>
              <description>desc SMP21</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues derivedFrom="SMP20"/>
            </field>
            <field>
              <name>SMP22</name>
              <description>desc SMP22</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues derivedFrom="SMP20"/>
            </field>
            <field>
              <name>SMP23</name>
              <description>desc SMP23</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues derivedFrom="SMP20"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <description>desc SMPR2</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SMP10</name>
              <description>desc SMP10</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>SMP10</name>
                <enumeratedValue>
                  <name>Cycles3_5</name>
                  <description>3.5 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles5_5</name>
                  <description>5.5 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles7_5</name>
                  <description>7.5 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles13_5</name>
                  <description>13.5 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP11</name>
              <description>desc SMP11</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP12</name>
              <description>desc SMP12</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP13</name>
              <description>desc SMP13</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP14</name>
              <description>desc SMP14</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP15</name>
              <description>desc SMP15</description>
              <bitRange>[17:15]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP16</name>
              <description>desc SMP16</description>
              <bitRange>[20:18]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP17</name>
              <description>desc SMP17</description>
              <bitRange>[23:21]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP18</name>
              <description>desc SMP18</description>
              <bitRange>[26:24]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
            <field>
              <name>SMP19</name>
              <description>desc SMP19</description>
              <bitRange>[29:27]</bitRange>
              <enumeratedValues derivedFrom="SMP10"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR3</name>
          <description>desc SMPR2</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SMP0</name>
              <description>desc SMP0</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <name>SMP0</name>
                <enumeratedValue>
                  <name>Cycles3_5</name>
                  <description>3.5 cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles5_5</name>
                  <description>5.5 cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles7_5</name>
                  <description>7.5 cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cycles13_5</name>
                  <description>13.5 cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMP1</name>
              <description>desc SMP1</description>
              <bitRange>[5:3]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP2</name>
              <description>desc SMP2</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP3</name>
              <description>desc SMP3</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP4</name>
              <description>desc SMP4</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP5</name>
              <description>desc SMP5</description>
              <bitRange>[17:15]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP6</name>
              <description>desc SMP6</description>
              <bitRange>[20:18]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP7</name>
              <description>desc SMP7</description>
              <bitRange>[23:21]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP8</name>
              <description>desc SMP8</description>
              <bitRange>[26:24]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
            <field>
              <name>SMP9</name>
              <description>desc SMP9</description>
              <bitRange>[29:27]</bitRange>
              <enumeratedValues derivedFrom="SMP0"/>
            </field>
          </fields>
        </register>
