burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>JOFR1</name>
          <description>desc JOFR1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>JOFFSET1</name>
              <description>desc JOFFSET1</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR2</name>
          <description>desc JOFR2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>JOFFSET2</name>
              <description>desc JOFFSET2</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR3</name>
          <description>desc JOFR3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>JOFFSET3</name>
              <description>desc JOFFSET3</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JOFR4</name>
          <description>desc JOFR4</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>JOFFSET4</name>
              <description>desc JOFFSET4</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR</name>
          <description>desc HTR</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>HT</name>
              <description>desc HT</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR</name>
          <description>desc LTR</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>LT</name>
              <description>desc LT</description>
              <bitRange>[11:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4095</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <description>desc SQR1</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SQ13</name>
              <description>desc SQ13</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ14</name>
              <description>desc SQ14</description>
              <bitRange>[9:5]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ15</name>
              <description>desc SQ15</description>
              <bitRange>[14:10]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ16</name>
              <description>desc SQ16</description>
              <bitRange>[19:15]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>L</name>
              <description>desc L</description>
              <bitRange>[23:20]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <description>desc SQR2</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>SQ7</name>
              <description>desc SQ7</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ8</name>
              <description>desc SQ8</description>
              <bitRange>[9:5]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ9</name>
              <description>desc SQ9</description>
              <bitRange>[14:10]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ10</name>
              <description>desc SQ10</description>
              <bitRange>[19:15]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ11</name>
              <description>desc SQ11</description>
              <bitRange>[24:20]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ12</name>
              <description>desc SQ12</description>
              <bitRange>[29:25]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <description>desc SQR3</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>SQ1</name>
              <description>desc SQ1</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ2</name>
              <description>desc SQ2</description>
              <bitRange>[9:5]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ3</name>
              <description>desc SQ3</description>
              <bitRange>[14:10]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ4</name>
              <description>desc SQ4</description>
              <bitRange>[19:15]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ5</name>
              <description>desc SQ5</description>
              <bitRange>[24:20]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SQ6</name>
              <description>desc SQ6</description>
              <bitRange>[29:25]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <description>desc JSQR</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>JSQ1</name>
              <description>desc JSQ1</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>JSQ2</name>
              <description>desc JSQ2</description>
              <bitRange>[9:5]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>JSQ3</name>
              <description>desc JSQ3</description>
              <bitRange>[14:10]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>JSQ4</name>
              <description>desc JSQ4</description>
              <bitRange>[19:15]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>31</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>JL</name>
              <description>desc JL</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues>
                <name>JL</name>
                <enumeratedValue>
                  <name>Conversion1</name>
                  <description>1 Conversion</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transition2</name>
                  <description>2 Transitions</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Conversion3</name>
                  <description>3 Conversions</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Transition4</name>
                  <description>4 Transitions</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>desc JDR1</description>
          <addressOffset>0x40</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>JDR1</name>
              <description>desc JDR1</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>desc JDR2</description>
          <addressOffset>0x44</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>JDR2</name>
              <description>desc JDR2</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>desc JDR3</description>
          <addressOffset>0x48</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>JDR3</name>
              <description>desc JDR3</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>desc JDR4</description>
          <addressOffset>0x4C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>JDR4</name>
              <description>desc JDR4</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0x50</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>desc CCSR</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>desc CALSEL</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>CALSEL</name>
                <enumeratedValue>
                  <name>OffsetLinearity</name>
                  <description>Calibration of OFFSET and linearity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offset</name>
                  <description>Calibration of OFFSET only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSMP</name>
              <description>desc CALSMP</description>
              <bitRange>[13:12]</bitRange>
              <enumeratedValues>
                <name>CALSMP</name>
                <enumeratedValue>
                  <name>Clock1</name>
                  <description>1 ADC clock period</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Clock2</name>
                  <description>2 ADC clock periods</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Clock4</name>
                  <description>4 ADC clock periods</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Clock8</name>
                  <description>8 ADC clock periods</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALBYP</name>
              <description>desc CALBYP</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues>
                <name>CALBYPR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Calibration factor bypass not successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Calibration factor bypass successful</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>CALBYPW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALSET</name>
              <description>desc CALSET</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>CALSETR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Valid</name>
                  <description>Capacitance factor selection valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotValid</name>
                  <description>Capacitance factor not valid</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>CALSETW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFSUC</name>
              <description>desc OFFSUC</description>
              <bitRange>[29:29]</bitRange>
              <enumeratedValues>
                <name>OFFSUCR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSuccessful</name>
                  <description>Offset calibration not successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Successful</name>
                  <description>Offset calibration successful</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>OFFSUCW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Set to zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPSUC</name>
              <description>desc CALFAIL</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues>
                <name>CAPSUCR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSuccessful</name>
                  <description>Capacitance calibration not successful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Successful</name>
                  <description>Capacitance calibration successful</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>CAPSUCW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Set to zero</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALON</name>
              <description>desc CALON</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>CALON</name>
                <enumeratedValue>
                  <name>InProgress</name>
                  <description>ADC calibration in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Completed</name>
                  <description>ADC calibration completed or has not been initiated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
