burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator2</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC_COMP</name>
        <description>ADC and COMP Interrupt through EXTI Lines 17 and 18</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>COMP enable bit</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator 1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator 1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis enable selector</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>HYST</name>
                <enumeratedValue>
                  <name>No</name>
                  <description>no Comp1 hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Comp1 hysteresis voltage approx 20mV</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for inverting input INM</description>
              <bitRange>[5:2]</bitRange>
              <enumeratedValues>
                <name>INMSEL</name>
                <enumeratedValue>
                  <name>Inm0</name>
                  <description>COMP1_INM0 from PA0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm1</name>
                  <description>COMP1_INM1 from PA1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm2</name>
                  <description>COMP1_INM2 from PA2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm3</name>
                  <description>COMP1_INM3 from PA3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm4</name>
                  <description>COMP1_INM4 from PA4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm5</name>
                  <description>COMP1_INM5 from PA5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm6</name>
                  <description>COMP1_INM6 from PA6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm7</name>
                  <description>COMP1_INM7 from PA7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm8</name>
                  <description>COMP1_INM8 from PC4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm9</name>
                  <description>COMP1_INM9 from PC5</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm11</name>
                  <description>COMP1_INM11 from resistor voltage divider</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm12</name>
                  <description>COMP1_INM12 from TS_VIN</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm13</name>
                  <description>COMP1_INM13 from VREF1P2</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm14</name>
                  <description>COMP1_INM14 from VREFBUF</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inm15</name>
                  <description>COMP1_INM15 from OPA1_VIN</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for non-inverting input</description>
              <bitRange>[9:6]</bitRange>
              <enumeratedValues>
                <name>INPSEL</name>
                <enumeratedValue>
                  <name>Inp0</name>
                  <description>COMP1_INP0 from PC0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp1</name>
                  <description>COMP1_INP1 from PC1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp2</name>
                  <description>COMP1_INP2 from PC2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp3</name>
                  <description>COMP1_INP3 from PC3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp4</name>
                  <description>COMP1_INP4 from PA0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp5</name>
                  <description>COMP1_INP5 from PA1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp6</name>
                  <description>COMP1_INP6 from PA2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp7</name>
                  <description>COMP1_INP7 from PA3</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp8</name>
                  <description>COMP1_INP8 from PA4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp9</name>
                  <description>COMP1_INP9 from PA5</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp10</name>
                  <description>COMP1_INP10 from PA6</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp11</name>
                  <description>COMP1_INP11 from PA7</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp12</name>
                  <description>COMP1_INP12 from PB4</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp13</name>
                  <description>COMP1_INP13 from PB5</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inp14</name>
                  <description>COMP1_INP14 from PB6</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input selector for window mode</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>WINMODE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity selector</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>POLARITY</name>
                <enumeratedValue>
                  <name>NotInverted</name>
                  <description>Output is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inverted</name>
                  <description>Output is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode selector</description>
              <bitRange>[19:18]</bitRange>
              <enumeratedValues>
                <name>PWRMODE</name>
                <enumeratedValue>
                  <name>HighSpeed</name>
                  <description>High speed 250 ua</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MediumSpeed</name>
                  <description>Medium speed 5 ua</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output status</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues>
                <name>VALUER</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Comparator output is low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Comparator output is high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filter register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN2</name>
              <description>Filter enable bit</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>FLTEN2</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator digital filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator digital filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLTCNT2</name>
              <description>Comparator filter and counter</description>
              <bitRange>[31:16]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
