burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <displayName>DR</displayName>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register</description>
              <bitRange>[31:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>Independent Data register</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RESET</name>
              <description>Reset bit</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>RESETW</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Resets the CRC calculation unit and sets the data register to 0xFFFF FFFF</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CTC</name>
      <description>desc CTC</description>
      <groupName>CTC</groupName>
      <baseAddress>0x40006C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC and CTC global Interrupts</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL0</name>
          <description>desc CTL0</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00004000</resetValue>
          <fields>
            <field>
              <name>CKOKIE</name>
              <description>desc CKOKIE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CKWARNIE</name>
              <description>desc CKWARNIE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EREFIE</name>
              <description>desc EREFIE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNTEN</name>
              <description>desc CNTEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUTOTRIM</name>
              <description>desc AUTOTRIM</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWREFPUL</name>
              <description>desc SWREFPUL</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TRIMVALUE</name>
              <description>desc TRIMVALUE</description>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <description>desc CTL1</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x2022BB7F</resetValue>
          <fields>
            <field>
              <name>RLVALUE</name>
              <description>desc RLVALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CKLIM</name>
              <description>desc CKLIM</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>REFPSC</name>
              <description>desc REFPSC</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>REFSEL</name>
              <description>desc REFSEL</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>REFPOL</name>
              <description>desc REFPOL</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x8</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CKOKIF</name>
              <description>desc CKOKIF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CKWARNIF</name>
              <description>desc CKWARNIF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIF</name>
              <description>desc ERRIF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EREFIF</name>
              <description>desc EREFIF</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CKERR</name>
              <description>desc CKERR</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFMISS</name>
              <description>desc REFMISS</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMERR</name>
              <description>desc TRIMERR</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFDIR</name>
              <description>desc REFDIR</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>REFCAP</name>
              <description>desc REFCAP</description>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <description>desc INTC</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>CKOKIC</name>
              <description>desc CKOKIC</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CKWARNIC</name>
              <description>desc CKWARNIC</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRIC</name>
              <description>desc ERRIC</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>EREFIC</name>
              <description>desc EREFIC</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
