burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>REV_ID</description>
              <bitRange>[30:0]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <description>DBG ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <description>Debug Sleep Mode</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>DBG_STOP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug Stop Mode Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug Stop Mode Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER2_STOP</name>
              <description>Debug Timer 2 stopped when Core is halted</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>DBG_TIMER2_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The counter clock of TIMx is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The counter clock of TIMx is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIMER3_STOP</name>
              <description>Debug Timer 3 stopped when Core is halted</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER2_STOP"/>
            </field>
            <field>
              <name>DBG_TIMER6_STOP</name>
              <description>Debug Timer 6 stopped when Core is halted</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER2_STOP"/>
            </field>
            <field>
              <name>DBG_TIMER7_STOP</name>
              <description>Debug Timer 7 stopped when Core is halted</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER2_STOP"/>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <description>Debug RTC stopped when Core is halted</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>DBG_RTC_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The clock of the RTC counter is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The clock of the RTC counter is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <description>Debug Window Wachdog stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>DBG_WWDG_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The window watchdog counter clock continues even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The window watchdog counter clock is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped when Core is halted</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues>
                <name>DBG_IWDG_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The independent watchdog counter clock continues even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The independent watchdog counter clock is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_I2C1_SMBUS_TIMEOUT</name>
              <description>DBG_I2C1_SMBUS_TIMEOUT</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBG_I2C2_SMBUS_TIMEOUT</name>
              <description>DBG_I2C2_SMBUS_TIMEOUT</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core is halted</description>
              <bitRange>[31:31]</bitRange>
              <enumeratedValues>
                <name>DBG_LPTIM_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>LPTIMx counter clock is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>LPTIMx counter clock is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core is halted</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>DBG_TIMER1_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The counter clock of TIMx is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The counter clock of TIMx is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIMER14_STOP</name>
              <description>Debug Timer 14 stopped when Core is halted</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER1_STOP"/>
            </field>
            <field>
              <name>DBG_TIMER15_STOP</name>
              <description>Debug Timer 15 stopped when Core is halted</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER1_STOP"/>
            </field>
            <field>
              <name>DBG_TIMER16_STOP</name>
              <description>Debug Timer 16 stopped when Core is halted</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER1_STOP"/>
            </field>
            <field>
              <name>DBG_TIMER17_STOP</name>
              <description>Debug Timer 17 stopped when Core is halted</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="DBG_TIMER1_STOP"/>
            </field>
          </fields>
        </register>
