burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EXTI</name>
      <description>External interrupt/event controller</description>
      <groupName>EXTI</groupName>
      <baseAddress>0x40021800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD Interrupt through EXTI Lines 16</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>EXTI0_1</name>
        <description>EXTI Line 0 and 1 Interrupt</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>EXTI2_3</name>
        <description>EXTI Line 2 and 3 Interrupt</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EXTI4_15</name>
        <description>EXTI Line 4 to 15 Interrupt</description>
        <value>7</value>
      </interrupt>
      <registers>
        <register>
          <name>RTSR</name>
          <displayName>RTSR</displayName>
          <description>EXTI rising trigger selection register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RT0</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>RT0</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Rising edge trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Rising edge trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT1</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT2</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT3</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT4</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT5</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT6</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT7</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT8</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT9</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT10</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT11</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT12</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT13</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT14</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT15</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT16</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT17</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT18</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
            <field>
              <name>RT20</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="RT0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>FTSR</name>
          <displayName>FTSR</displayName>
          <description>EXTI falling trigger selection register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FT0</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>FT0</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Falling edge trigger is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Falling edge trigger is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FT1</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT2</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT3</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT4</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT5</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT6</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT7</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT8</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT9</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT10</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT11</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT12</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT13</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT14</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT15</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT16</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT17</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT18</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
            <field>
              <name>FT20</name>
              <description>Falling trigger event configuration bit of Configurable Event input</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="FT0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>SWIER</name>
          <displayName>SWIER</displayName>
          <description>EXTI software interrupt event register</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SWI0</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>SWI0W</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Pend</name>
                  <description>Generates an interrupt request</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWI1</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI2</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI3</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI4</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI5</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI6</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI7</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI8</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI9</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI10</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI11</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI12</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI13</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI14</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI15</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI16</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI17</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI18</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
            <field>
              <name>SWI20</name>
              <description>Rising trigger event configuration bit of Configurable Event input</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="SWI0W"/>
            </field>
          </fields>
        </register>
