burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>desc FLASH</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <description>desc ACR</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000500</resetValue>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>desc LATENCY</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>LATENCY</name>
                <enumeratedValue>
                  <name>WS0</name>
                  <description>0 wait states</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WS1</name>
                  <description>1 wait state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <description>desc KEYR</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <description>desc OPTKEYR</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>desc OPTKEY</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>4294967295</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>desc EOP</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>EOP</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No EOP operation occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>An EOP event occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRPERR</name>
              <description>desc WRPERR</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>WRPERR</name>
                <enumeratedValue>
                  <name>NoError</name>
                  <description>No write protection error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Error</name>
                  <description>A write protection error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>desc OPTVERR</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>OPTVERR</name>
                <enumeratedValue>
                  <name>NoError</name>
                  <description>No option and Engineering bits loading validity error occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Error</name>
                  <description> An option and Engineering bits loading validity error occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSY</name>
              <description>desc BSY</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>BSYR</name>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>No write/erase operation is in progress</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>A write/erase operation is in progress</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PG</name>
              <description>desc PG</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>PG</name>
                <enumeratedValue>
                  <name>Program</name>
                  <description>Flash programming activated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PER</name>
              <description>desc PER</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>PER</name>
                <enumeratedValue>
                  <name>PageErase</name>
                  <description>Erase activated for selected page</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MER</name>
              <description>desc MER</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>MER</name>
                <enumeratedValue>
                  <name>MassErase</name>
                  <description>Erase activated for all user sectors</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SER</name>
              <description>desc SER</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>SER</name>
                <enumeratedValue>
                  <name>SectorErase</name>
                  <description>Erase activated for user sectors</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>desc OPTSTRT</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues>
                <name>OPTSTRT</name>
                <enumeratedValue>
                  <name>OptionByteProgram</name>
                  <description>Option byte program start</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>desc PGSTRT</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>desc EOPIE</description>
              <bitRange>[24:24]</bitRange>
              <enumeratedValues>
                <name>EOPIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>End of operation interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>End of operation interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <bitRange>[25:25]</bitRange>
              <enumeratedValues>
                <name>ERRIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Error interrupt generation disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Error interrupt generation enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>desc OBL_LAUNCH</description>
              <bitRange>[27:27]</bitRange>
              <enumeratedValues>
                <name>OBL_LAUNCH</name>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Force option byte loading inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Force option byte loading active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>desc OPTLOCK</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues>
                <name>OPTLOCK</name>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Options is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Options is locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK</name>
              <description>desc LOCK</description>
              <bitRange>[31:31]</bitRange>
              <enumeratedValues>
                <name>LOCK</name>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>FLASH_CR register is unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>FLASH_CR register is locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>desc OPTR</description>
          <addressOffset>0x20</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>RDP</name>
              <description>desc RDP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>RDP</name>
                <enumeratedValue>
                  <name>Level1</name>
                  <description>Level 1, memories readout protection active (writes 0x88)</description>
                  <value>136</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Level0</name>
                  <description>Level 0, readout protection not active</description>
                  <value>170</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Level2</name>
                  <description>Level 2, chip readout protection active</description>
                  <value>204</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>desc IWDG_SW</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>desc WWDG_SW</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>WWDG_SW</name>
                <enumeratedValue>
                  <name>Hardware</name>
                  <description>Hardware window watchdog</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Software</name>
                  <description>Software window watchdog</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRST_MODE</name>
              <description>desc NRST_MODE</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>NRST_MODE</name>
                <enumeratedValue>
                  <name>NRST</name>
                  <description>Configure as NRST pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>Configure as GPIO pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>nBOOT1</name>
              <description>desc nBOOT1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>nBOOT1</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Select boot mode together with BOOT Pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Select boot mode together with BOOT Pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>desc IWDG_STOP</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDKR</name>
          <description>desc SDKR</description>
          <addressOffset>0x24</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SDK_STRT</name>
              <description>desc SDK_STRT</description>
              <bitRange>[4:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BOR_EN</name>
              <description>desc BOR_EN</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SDK_END</name>
              <description>desc SDK_END</description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>desc BOR_LEV</description>
              <bitRange>[15:13]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <description>desc WRPR</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>WRP</name>
              <description>desc WRP</description>
              <bitRange>[15:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR</name>
          <description>desc STCR</description>
          <addressOffset>0x90</addressOffset>
          <resetValue>0x00006400</resetValue>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>desc SLEEP_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLEEP_TIME</name>
              <description>desc SLEEP_TIME</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <description>desc TS0</description>
          <addressOffset>0x100</addressOffset>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>TS0</name>
              <description>desc TS0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <description>desc TS1</description>
          <addressOffset>0x104</addressOffset>
          <resetValue>0x000001B0</resetValue>
          <fields>
            <field>
              <name>TS1</name>
              <description>desc TS1</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <description>desc TS2P</description>
          <addressOffset>0x108</addressOffset>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>TS2P</name>
              <description>desc TS2P</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <description>desc TPS3</description>
          <addressOffset>0x10C</addressOffset>
          <resetValue>0x000006C0</resetValue>
          <fields>
            <field>
              <name>TPS3</name>
              <description>desc TPS3</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <description>desc TS3</description>
          <addressOffset>0x110</addressOffset>
          <resetValue>0x000000B4</resetValue>
          <fields>
            <field>
              <name>TS3</name>
              <description>desc TS3</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PERTPE</name>
          <description>desc PERTPE</description>
          <addressOffset>0x114</addressOffset>
          <resetValue>0x0000EA60</resetValue>
          <fields>
            <field>
              <name>PERTPE</name>
              <description>desc PERTPE</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMERTPE</name>
          <description>desc SMERTPE</description>
          <addressOffset>0x118</addressOffset>
          <resetValue>0x0000FD20</resetValue>
          <fields>
            <field>
              <name>SMERTPE</name>
              <description>desc SMERTPE</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>desc PRGTPE</description>
          <addressOffset>0x11C</addressOffset>
          <resetValue>0x00008CA0</resetValue>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>desc PRGTPE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>desc PRETPE</description>
          <addressOffset>0x120</addressOffset>
          <resetValue>0x000012C0</resetValue>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>desc PRETPE</description>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
