burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>ID0</name>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Input is logic low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Input is logic high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID8</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID9</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID10</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID11</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID12</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID13</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID14</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID15</name>
              <description>Port input data (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>OD0</name>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Set output to logic low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Set output to logic high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OD1</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD2</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD3</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD4</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD5</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD6</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD7</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD8</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD9</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD10</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD11</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD12</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD13</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD14</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD15</name>
              <description>Port output data (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO port bit set/reset register</description>
          <addressOffset>0x18</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>BS0W</name>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Sets the corresponding ODx bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BR0</name>
              <description>Port x set bit y (y=0-15)</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <name>BR0W</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Resets the corresponding ODx bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[19:19]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[22:22]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[23:23]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[24:24]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[25:25]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[26:26]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[27:27]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[29:29]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset bit y (y=0-15)</description>
              <bitRange>[31:31]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>GPIO port configuration lock register</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LCK0</name>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Port configuration not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Port configuration locked</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCK1</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK2</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK3</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK4</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK5</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK6</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK7</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK8</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK9</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK10</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK11</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK12</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK13</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK14</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCK15</name>
              <description>Port x lock bit y (y=0-15)</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="LCK0"/>
            </field>
            <field>
              <name>LCKK</name>
              <description>Port x lock (LCKK)</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues>
                <name>LCKK</name>
                <enumeratedValue>
                  <name>NotActive</name>
                  <description>Port configuration lock key not active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Port configuration lock key active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
