burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>GPIO alternate function low register</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <name>AFSEL0</name>
                <enumeratedValue>
                  <name>AF0</name>
                  <description>AF0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF1</name>
                  <description>AF1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF2</name>
                  <description>AF2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF3</name>
                  <description>AF3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF4</name>
                  <description>AF4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF5</name>
                  <description>AF5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF6</name>
                  <description>AF6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF7</name>
                  <description>AF7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF8</name>
                  <description>AF8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF9</name>
                  <description>AF9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF10</name>
                  <description>AF10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF11</name>
                  <description>AF11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF12</name>
                  <description>AF12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF13</name>
                  <description>AF13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF14</name>
                  <description>AF14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF15</name>
                  <description>AF15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[19:16]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>Alternate function selection for port x bit y (y=0-7)</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues derivedFrom="AFSEL0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>GPIO alternate function high register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <name>AFSEL8</name>
                <enumeratedValue>
                  <name>AF0</name>
                  <description>AF0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF1</name>
                  <description>AF1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF2</name>
                  <description>AF2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF3</name>
                  <description>AF3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF4</name>
                  <description>AF4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF5</name>
                  <description>AF5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF6</name>
                  <description>AF6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF7</name>
                  <description>AF7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF8</name>
                  <description>AF8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF9</name>
                  <description>AF9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF10</name>
                  <description>AF10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF11</name>
                  <description>AF11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF12</name>
                  <description>AF12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF13</name>
                  <description>AF13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF14</name>
                  <description>AF14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AF15</name>
                  <description>AF15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[7:4]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[11:8]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[15:12]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[19:16]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>Alternate function selection for port x bit y (y=8-15)</description>
              <bitRange>[31:28]</bitRange>
              <enumeratedValues derivedFrom="AFSEL8"/>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <displayName>BRR</displayName>
          <description>port bit reset register</description>
          <addressOffset>0x28</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>BR0</name>
              <description>Port Reset bit</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>BR0W</name>
                <enumeratedValue>
                  <name>NoAction</name>
                  <description>No action on the corresponding ODx bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the ODx bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BR1</name>
              <description>Port Reset bit</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR2</name>
              <description>Port Reset bit</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR3</name>
              <description>Port Reset bit</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR4</name>
              <description>Port Reset bit</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR5</name>
              <description>Port Reset bit</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR6</name>
              <description>Port Reset bit</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR7</name>
              <description>Port Reset bit</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR8</name>
              <description>Port Reset bit</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR9</name>
              <description>Port Reset bit</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR10</name>
              <description>Port Reset bit</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR11</name>
              <description>Port Reset bit</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR12</name>
              <description>Port Reset bit</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR13</name>
              <description>Port Reset bit</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR14</name>
              <description>Port Reset bit</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR15</name>
              <description>Port Reset bit</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
          </fields>
        </register>
