burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>LCD CONTROLLER</description>
      <groupName>LCD</groupName>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <description>LCD global Interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CR0</name>
          <displayName>CR0</displayName>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>LCD disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>LCD enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDCLK</name>
              <description>LCDCLK</description>
              <bitRange>[2:1]</bitRange>
              <enumeratedValues>
                <name>LCDCLK</name>
                <enumeratedValue>
                  <name>Hz64</name>
                  <description>64 Hz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz128</name>
                  <description>128 Hz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz256</name>
                  <description>256 Hz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hz512</name>
                  <description>512 Hz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIAS</name>
              <description>BIAS</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues>
                <name>BIAS</name>
                <enumeratedValue>
                  <name>Bias3</name>
                  <description>1/3 bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bias2</name>
                  <description>1/2 bias</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUTY</name>
              <description>DUTY</description>
              <bitRange>[8:6]</bitRange>
              <enumeratedValues>
                <name>DUTY</name>
                <enumeratedValue>
                  <name>Static</name>
                  <description>Static</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Duty2</name>
                  <description>1/2 duty</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Duty3</name>
                  <description>1/3 duty</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Duty4</name>
                  <description>1/4 duty</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Duty6</name>
                  <description>1/6 duty</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Duty8</name>
                  <description>1/8 duty</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSEL</name>
              <description>BSEL</description>
              <bitRange>[11:9]</bitRange>
              <enumeratedValues>
                <name>BSEL</name>
                <enumeratedValue>
                  <name>Ext</name>
                  <description>External resistor mode, external circuitry required</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IntMed</name>
                  <description> Internal resistive divider, medium power consumption mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IntSm</name>
                  <description>Internal resistive voltage divider, small power consumption mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IntHi</name>
                  <description>Internal resistive voltage divider, high power mode</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTRAST</name>
              <description>CONTRAST</description>
              <bitRange>[15:12]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>CR1</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>BLINKCNT</name>
              <description>BLINKCNT</description>
              <bitRange>[5:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BLINKEN</name>
              <description>BLINKEN</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues>
                <name>BLINKEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>LCD splash screen disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>LCD splash screen enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>MODE</name>
                <enumeratedValue>
                  <name>Mode0</name>
                  <description>Mode 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mode1</name>
                  <description>Mode 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>IE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMAEN</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues>
                <name>DMAEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable LCD interrupt triggered DMA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables LCD interrupt triggering DMA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTF</name>
              <description>INTF</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues>
                <name>INTF</name>
                <enumeratedValue>
                  <name>NoInterrupt</name>
                  <description>No Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupt</name>
                  <description>Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <displayName>INTCLR</displayName>
          <description>INTCLR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>INTF_CLR</name>
              <description>INTF_CLR</description>
              <bitRange>[10:10]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>INTF_CLRW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear flag</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN0</name>
          <displayName>POEN0</displayName>
          <description>POEN0</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>S4</name>
              <description>S4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S5</name>
              <description>S5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S6</name>
              <description>S6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S7</name>
              <description>S7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>S8</name>
              <description>S8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>S9</name>
              <description>S9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>S10</name>
              <description>S10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>S11</name>
              <description>S11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>S12</name>
              <description>S12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>S13</name>
              <description>S13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>S14</name>
              <description>S14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>S15</name>
              <description>S15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>S16</name>
              <description>S16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>S17</name>
              <description>S17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>S18</name>
              <description>S18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>S19</name>
              <description>S19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>S20</name>
              <description>S20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>S21</name>
              <description>S21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>S22</name>
              <description>S22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>S23</name>
              <description>S23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>S24</name>
              <description>S24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>S25</name>
              <description>S25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>S26</name>
              <description>S26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>S27</name>
              <description>S27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>S28</name>
              <description>S28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>S29</name>
              <description>S29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>S30</name>
              <description>S30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>S31</name>
              <description>S31</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN1</name>
          <displayName>POEN1</displayName>
          <description>POEN1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>S32</name>
              <description>S32</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>S33</name>
              <description>S33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>S34</name>
              <description>S34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S35</name>
              <description>S35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>S39C4</name>
              <description>S39</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>S38C5</name>
              <description>S38</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>S37C6</name>
              <description>S37</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>S36C7</name>
              <description>S36</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C0</name>
              <description>C0</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>C1</name>
              <description>C1</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>C2</name>
              <description>C2</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>C3</name>
              <description>C3</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>MUX</name>
              <description>MUX</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM0</name>
          <displayName>RAM0</displayName>
          <description>des RAM0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1</name>
          <displayName>RAM1</displayName>
          <description>des RAM1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2</name>
          <displayName>RAM2</displayName>
          <description>des RAM2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM3</name>
          <displayName>RAM3</displayName>
          <description>des RAM3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM4</name>
          <displayName>RAM4</displayName>
          <description>des RAM4</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM5</name>
          <displayName>RAM5</displayName>
          <description>des RAM5</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM6</name>
          <displayName>RAM6</displayName>
          <description>des RAM6</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM7</name>
          <displayName>RAM7</displayName>
          <description>des RAM7</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM8</name>
          <displayName>RAM8</displayName>
          <description>des RAM8</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM9</name>
          <displayName>RAM9</displayName>
          <description>des RAM9</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM10</name>
          <displayName>RAM10</displayName>
          <description>des RAM10</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM11</name>
          <displayName>RAM11</displayName>
          <description>des RAM11</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM12</name>
          <displayName>RAM12</displayName>
          <description>des RAM12</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>des D</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
