burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>ECSCR</name>
          <displayName>ECSCR</displayName>
          <description>External clock source control register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <description>HSE_DRV</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>HSE_DRV</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable HSE drive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Lowest drive</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Medium</name>
                  <description>Medium drive</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Highest drive</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_STARTUP</name>
              <description>HSE_STARTUP</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>HSE_STARTUP</name>
                <enumeratedValue>
                  <name>ClockCycles1</name>
                  <description>HSEBYP=0 4096 LSE clock cycles, HSEBYP=1 2048 LSE clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockCycles2</name>
                  <description>HSEBYP=0 2048 LSE clock cycles, HSEBYP=1 1024 LSE clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockCycles3</name>
                  <description>HSEBYP=0 8192 LSE clock cycles, HSEBYP=1 4096 LSE clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DirectOutput</name>
                  <description>Direct Output, regardless of stabilization time</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSE_DRIVER</name>
              <description>LSE clock driver selection</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <name>LSE_DRIVER</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable LSE drive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Lowest drive</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Medium</name>
                  <description>Medium drive</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Highest drive</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSE_STARTUP</name>
              <description>LSE_STARTUP</description>
              <bitRange>[21:20]</bitRange>
              <enumeratedValues>
                <name>LSE_STARTUP</name>
                <enumeratedValue>
                  <name>ClockCycles1</name>
                  <description>LSEBYP=0 4096 LSE clock cycles, LSEBYP=1 2048 LSE clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockCycles2</name>
                  <description>LSEBYP=0 2048 LSE clock cycles, LSEBYP=1 1024 LSE clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ClockCycles3</name>
                  <description>LSEBYP=0 8192 LSE clock cycles, LSEBYP=1 4096 LSE clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DirectOutput</name>
                  <description>Direct Output, regardless of stabilization time</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <displayName>CIER</displayName>
          <description>Clock interrupt enable register</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <description>LSI ready interrupt enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LSIRDYIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Ready interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Ready interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>LSE ready interrupt enable</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYIE"/>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>HSI ready interrupt enable</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYIE"/>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>HSE ready interrupt enable</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYIE"/>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>PLL ready interrupt enable</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYIE"/>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <displayName>CIFR</displayName>
          <description>Clock interrupt flag register</description>
          <addressOffset>0x1C</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>LSI ready interrupt flag</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LSIRDYFR</name>
                <enumeratedValue>
                  <name>NotInterrupted</name>
                  <description>No clock ready interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Interrupted</name>
                  <description>Clock ready interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>LSE ready interrupt flag</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYFR"/>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>HSI ready interrupt flag</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYFR"/>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>HSE ready interrupt flag</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYFR"/>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>PLL ready interrupt flag</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYFR"/>
            </field>
            <field>
              <name>CSSF</name>
              <description>HSE clock secure system interrupt flag</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>CSSF</name>
                <enumeratedValue>
                  <name>NoClock</name>
                  <description>No clock security interrupt caused by HSE clock failure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Clock</name>
                  <description>Clock security interrupt caused by HSE clock failure</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSECSSF</name>
              <description>LSE clock secure system interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>LSECSSF</name>
                <enumeratedValue>
                  <name>NoFailure</name>
                  <description>No failure detected on LSE clock failure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Failure</name>
                  <description>Failure detected on LSE clock failure</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <displayName>CICR</displayName>
          <description>Clock interrupt clear register</description>
          <addressOffset>0x20</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <description>LSI ready interrupt clear</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LSIRDYCW</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>LSE ready interrupt clear</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYCW"/>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>HSI ready interrupt clear</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYCW"/>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>HSE ready interrupt clear</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYCW"/>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>PLL ready interrupt clear</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="LSIRDYCW"/>
            </field>
            <field>
              <name>CSSC</name>
              <description>clock secure system interrupt flag clear</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSECSSC</name>
              <description>LSE clock secure system interrupt flag clear</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>LSECSSCW</name>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear LSE clock secure system interrupt flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPRSTR</name>
          <displayName>IOPRSTR</displayName>
          <description>GPIO reset register</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <description>I/O port A reset</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>GPIOARST</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset I/O port</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIOBRST</name>
              <description>I/O port B reset</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
            <field>
              <name>GPIOCRST</name>
              <description>I/O port F reset</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
            <field>
              <name>GPIOFRST</name>
              <description>I/O port F reset</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="GPIOARST"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR</name>
          <displayName>AHBRSTR</displayName>
          <description>AHB peripheral reset register</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <description>DMA reset</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>DMARSTW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCRST</name>
              <description>CRC reset</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="DMARSTW"/>
            </field>
            <field>
              <name>DIVRST</name>
              <description>DIV reset</description>
              <bitRange>[24:24]</bitRange>
              <enumeratedValues derivedFrom="DMARSTW"/>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <displayName>APBRSTR1</displayName>
          <description>APB peripheral reset register 1</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>TIM2RST</name>
              <description>TIM2 timer reset</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>TIM2RSTW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM3RST</name>
              <description>TIM3 timer reset</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>TIM6RST</name>
              <description>TIM6 timer reset</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>TIM7RST</name>
              <description>TIM7 timer reset</description>
              <bitRange>[5:5]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>RTCAPBRST</name>
              <description>RTCAPB reset</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>WWDGRST</name>
              <description>WWDG reset</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>SPI2RST</name>
              <description>SPI2 reset</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>USART2RST</name>
              <description>USART2 reset</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>USART3RST</name>
              <description>USART3 reset</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>USART4RST</name>
              <description>USART4 reset</description>
              <bitRange>[19:19]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>I2C1 reset</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>I2C2RST</name>
              <description>I2C2 reset</description>
              <bitRange>[22:22]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>CTCRST</name>
              <description>CTCRST</description>
              <bitRange>[27:27]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>PWRRST</name>
              <description>Power interface reset</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>OPARST</name>
              <description>OPARST</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
            <field>
              <name>LPTIMRST</name>
              <description>Low Power Timer reset</description>
              <bitRange>[31:31]</bitRange>
              <enumeratedValues derivedFrom="TIM2RSTW"/>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <displayName>APBRSTR2</displayName>
          <description>APB peripheral reset register 2</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>SYSCFG reset</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>SYSCFGRSTW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCRST</name>
              <description>ADC reset</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>DBGRST</name>
              <description>DBG reset</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>TIM1 reset</description>
              <bitRange>[11:11]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>SPI1 reset</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>USART1RST</name>
              <description>USART1 reset</description>
              <bitRange>[14:14]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>TIM14 reset</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>TIM15RST</name>
              <description>TIM15 reset</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>TIM16RST</name>
              <description>TIM16 reset</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>TIM17RST</name>
              <description>TIM17 reset</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>COMP1RST</name>
              <description>COMP1 reset</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>COMP2RST</name>
              <description>COMP2 reset</description>
              <bitRange>[21:21]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
            <field>
              <name>LCDRST</name>
              <description>LCD reset</description>
              <bitRange>[23:23]</bitRange>
              <enumeratedValues derivedFrom="SYSCFGRSTW"/>
            </field>
          </fields>
        </register>
