burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI oscillator enable</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LSION</name>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Oscillator OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Oscillator ON</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI oscillator ready</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>LSIRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Oscillator not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Oscillator ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NRST_FLTDIS</name>
              <description>NRST_FLTDIS oscillator ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flags</description>
              <bitRange>[23:23]</bitRange>
              <enumeratedValues>
                <name>RMVFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the reset flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset flag</description>
              <bitRange>[25:25]</bitRange>
              <enumeratedValues>
                <name>OBLRSTFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoReset</name>
                  <description>No reset has occured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>A reset has occured</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag</description>
              <bitRange>[26:26]</bitRange>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>PWRRSTF</name>
              <description>BOR or POR/PDR flag</description>
              <bitRange>[27:27]</bitRange>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag</description>
              <bitRange>[28:28]</bitRange>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>Independent window watchdog reset flag</description>
              <bitRange>[29:29]</bitRange>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>Window watchdog reset flag</description>
              <bitRange>[30:30]</bitRange>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>desc RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC Interrupt through EXTI Lines 19</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>CRH</name>
          <description>desc CRH</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SECIE</name>
              <description>desc SECIE</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>SECIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Second interrupt is masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Second interrupt is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALRIE</name>
              <description>desc ALRIE</description>
              <bitRange>[1:1]</bitRange>
              <enumeratedValues>
                <name>ALRIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Alarm interrupt is masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Alarm interrupt is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OWIE</name>
              <description>desc OWIE</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>OWIE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Overflow interrupt is masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Overflow interrupt is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRL</name>
          <description>desc CRL</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>SECF</name>
              <description>desc SECF</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>SECFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoPrescalerOverflow</name>
                  <description>Second flag condition not met</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PrescalerOverflow</name>
                  <description>Second flag condition met</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>SECFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear flag</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALRF</name>
              <description>desc ALRF</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>ALRFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoAlarm</name>
                  <description>Alarm not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Alarm</name>
                  <description>Alarm detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>ALRFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear flag</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OWF</name>
              <description>desc OWF</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>OWFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoOverflow</name>
                  <description>Overflow not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Overflow</name>
                  <description>32-bit programmable counter overflow occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>OWFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear flag</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSF</name>
              <description>desc RSF</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              <enumeratedValues>
                <name>RSFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSynchronized</name>
                  <description>Registers not yet synchronized</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Synchronized</name>
                  <description>Registers synchronized</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <name>RSFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear flag</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNF</name>
              <description>desc CNF</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues>
                <name>CNF</name>
                <enumeratedValue>
                  <name>Exit</name>
                  <description>Exit configuration mode (start update of RTC registers)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enter configuration mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTOFF</name>
              <description>desc RTOFF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
              <enumeratedValues>
                <name>RTOFF</name>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Last write operation on RTC registers is still ongoing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Last write operation on RTC registers terminated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLH</name>
          <description>desc PRLH</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>PRLH</name>
              <description>desc PRL</description>
              <bitRange>[3:0]</bitRange>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLL</name>
          <description>desc PRLL</description>
          <addressOffset>0xC</addressOffset>
          <access>write-only</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>PRLL</name>
              <description>desc PRL</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVH</name>
          <description>desc DIVH</description>
          <addressOffset>0x10</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DIVH</name>
              <description>desc DIV</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVL</name>
          <description>desc DIVL</description>
          <addressOffset>0x14</addressOffset>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>DIVL</name>
              <description>desc DIV</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <description>desc CNTH</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CNTH</name>
              <description>desc RTC_CNT</description>
              <bitRange>[15:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <description>desc CNTL</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CNTL</name>
              <description>desc RTC_CNT</description>
              <bitRange>[15:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRH</name>
          <description>desc ALRH</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ALRH</name>
              <description>desc RTC_ALR</description>
              <bitRange>[15:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRL</name>
          <description>desc ALRL</description>
          <addressOffset>0x24</addressOffset>
          <resetValue>0x0000FFFF</resetValue>
          <fields>
            <field>
              <name>ALRL</name>
              <description>desc RTC_ALR</description>
              <bitRange>[15:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCR</name>
          <description>desc BKP_RTCCR</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>CAL</name>
              <description>desc CAL</description>
              <bitRange>[6:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>121</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CCO</name>
              <description>desc CCO</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
                <name>CCO</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Calibration clock output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Setting this bit output calibration clock (RTC clock / 64) on the pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASOE</name>
              <description>desc ASOE</description>
              <bitRange>[8:8]</bitRange>
              <enumeratedValues>
                <name>ASOE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Setting this bit outputs either the RTC Alarm pulse signal or the Second pulse signal on the TAMPER pin depending on the ASOS bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASOS</name>
              <description>desc ASOS</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues>
                <name>ASOS</name>
                <enumeratedValue>
                  <name>Alarm</name>
                  <description>RTC Alarm pulse output selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Second</name>
                  <description>RTC Second pulse output selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
