burgrp/py32-svd/svd/py32f040.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>desc SYSCFG</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>desc CFGR1</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00FF0000</resetValue>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>desc MEM_MODE</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <name>MEM_MODE</name>
                <enumeratedValue>
                  <name>MainFlash</name>
                  <description>Main Flash memory mapped at 0x0000_0000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SystemFlash</name>
                  <description>System Flash memory mapped at 0x0000_0000</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MainFlash2</name>
                  <description>Main Flash memory mapped at 0x0000_0000</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>Embedded SRAM mapped at 0x0000_0000</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM1_IC1_SRC</name>
              <description>desc TIM1_IC1_SRC</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <name>TIM1_IC1_SRC</name>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>From TIM?_CH* IO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Comp1</name>
                  <description>From Comp 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Comp2</name>
                  <description>From Comp 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Comp3</name>
                  <description>From Comp 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM2_IC4_SRC</name>
              <description>desc TIM2_IC4_SRC</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues derivedFrom="TIM1_IC1_SRC"/>
            </field>
            <field>
              <name>TIM3_IC1_SRC</name>
              <description>desc TIM3_IC1_SRC</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues derivedFrom="TIM1_IC1_SRC"/>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>desc ETR_SRC_TIM1</description>
              <bitRange>[10:8]</bitRange>
              <enumeratedValues>
                <name>ETR_SRC_TIM1</name>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>TIM*_ETR is connected to GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>TIM*_ETR is connected to COMP1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2</name>
                  <description>TIM*_ETR is connected to COMP2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>TIM*_ETR is connected to ADC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETR_SRC_TIM2</name>
              <description>desc ETR_SRC_TIM2</description>
              <bitRange>[14:12]</bitRange>
              <enumeratedValues derivedFrom="ETR_SRC_TIM1"/>
            </field>
            <field>
              <name>ETR_SRC_TIM3</name>
              <description>desc ETR_SRC_TIM3</description>
              <bitRange>[18:16]</bitRange>
              <enumeratedValues derivedFrom="ETR_SRC_TIM1"/>
            </field>
            <field>
              <name>GPIO_AHB_SEL</name>
              <description>desc GPIO_AHB_SEL</description>
              <bitRange>[24:24]</bitRange>
              <enumeratedValues>
                <name>GPIO_AHB_SEL</name>
                <enumeratedValue>
                  <name>FastIO</name>
                  <description>Fast IO bus access to GPIO register control</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHB</name>
                  <description>AHB bus access to GPIO register control</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>desc LOCKUP_LOCK</description>
              <bitRange>[0:0]</bitRange>
              <enumeratedValues>
                <name>LOCKUP_LOCK</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Cortex-M0+ LOCKUP output disconnected from TIM1/16/17 Break input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Cortex-M0+ LOCKUP output connected to TIM1/16/17 Break input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>desc PVD_LOCK</description>
              <bitRange>[2:2]</bitRange>
              <enumeratedValues>
                <name>PVD_LOCK</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>PVD LOCKUP output disconnected from TIM1/16/17 Break input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>PVD LOCKUP output connected to TIM1/16/17 Break input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>desc COMP1_BRK_TIM1</description>
              <bitRange>[3:3]</bitRange>
              <enumeratedValues>
                <name>COMP1_BRK_TIM1</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>COMP? output not connect to TIM? Break input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>COMP? output connected to TIM? Break input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>desc COMP2_BRK_TIM1</description>
              <bitRange>[4:4]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP1_BRK_TIM15</name>
              <description>desc COMP1_BRK_TIM15</description>
              <bitRange>[6:6]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP2_BRK_TIM15</name>
              <description>desc COMP2_BRK_TIM15</description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP1_BRK_TIM16</name>
              <description>desc COMP1_BRK_TIM16</description>
              <bitRange>[9:9]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP2_BRK_TIM16</name>
              <description>desc COMP2_BRK_TIM16</description>
              <bitRange>[10:10]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP1_BRK_TIM17</name>
              <description>desc COMP1_BRK_TIM17</description>
              <bitRange>[12:12]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP2_BRK_TIM17</name>
              <description>desc COMP2_BRK_TIM17</description>
              <bitRange>[13:13]</bitRange>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM1</name>
              <description>desc COMP1_OCREF_CLR_TIM1</description>
              <bitRange>[15:15]</bitRange>
              <enumeratedValues>
                <name>COMP1_OCREF_CLR_TIM1</name>
                <enumeratedValue>
                  <name>NotUsed</name>
                  <description>COMP? output not used as TIM? ocref_clr input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Used</name>
                  <description>COMP? output used as TIM? ocref_clr input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM2</name>
              <description>desc COMP1_OCREF_CLR_TIM2</description>
              <bitRange>[16:16]</bitRange>
              <enumeratedValues derivedFrom="COMP1_OCREF_CLR_TIM1"/>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM3</name>
              <description>desc COMP1_OCREF_CLR_TIM3</description>
              <bitRange>[17:17]</bitRange>
              <enumeratedValues derivedFrom="COMP1_OCREF_CLR_TIM1"/>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM1</name>
              <description>desc COMP2_OCREF_CLR_TIM1</description>
              <bitRange>[18:18]</bitRange>
              <enumeratedValues derivedFrom="COMP1_OCREF_CLR_TIM1"/>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM2</name>
              <description>desc COMP2_OCREF_CLR_TIM2</description>
              <bitRange>[19:19]</bitRange>
              <enumeratedValues derivedFrom="COMP1_OCREF_CLR_TIM1"/>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM3</name>
              <description>desc COMP2_OCREF_CLR_TIM3</description>
              <bitRange>[20:20]</bitRange>
              <enumeratedValues derivedFrom="COMP1_OCREF_CLR_TIM1"/>
            </field>
          </fields>
        </register>
