burgrp/py32-svd/svd/py32f040.svd
        <register>
          <name>CFGR3</name>
          <description>desc CFGR3</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>desc DMA1_MAP</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <name>DMA1_MAP</name>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC DMA requests mapped on DMA?</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX</name>
                  <description>SPI1_TX DMA requests mapped on DMA?</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX</name>
                  <description>SPI1_RX DMA requests mapped on DMA?</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX</name>
                  <description>SPI2_TX DMA requests mapped on DMA?</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX</name>
                  <description>SPI2_RX DMA requests mapped on DMA?</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_TX</name>
                  <description>USART1_TX DMA requests mapped on DMA?</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_RX</name>
                  <description>USART1_RX DMA requests mapped on DMA?</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_TX</name>
                  <description>USART2_TX DMA requests mapped on DMA?</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_RX</name>
                  <description>USART2_RX DMA requests mapped on DMA?</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_TX</name>
                  <description>USART3_TX DMA requests mapped on DMA?</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_RX</name>
                  <description>USART3_RX DMA requests mapped on DMA?</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART4_TX</name>
                  <description>USART4_TX DMA requests mapped on DMA?</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART4_RX</name>
                  <description>USART4_RX DMA requests mapped on DMA?</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_TX</name>
                  <description>I2C1_TX DMA requests mapped on DMA?</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_RX</name>
                  <description>I2C1_RX DMA requests mapped on DMA?</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C2_TX</name>
                  <description>I2C2_TX DMA requests mapped on DMA?</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C2_RX</name>
                  <description>I2C2_RX DMA requests mapped on DMA?</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH1</name>
                  <description>TIM1_CH1 DMA requests mapped on DMA?</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH2</name>
                  <description>TIM1_CH2 DMA requests mapped on DMA?</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH3</name>
                  <description>TIM1_CH3 DMA requests mapped on DMA?</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH4</name>
                  <description>TIM1_CH4 DMA requests mapped on DMA?</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_COM</name>
                  <description>TIM1_COM DMA requests mapped on DMA?</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_TRIG</name>
                  <description>TIM1_TRIG DMA requests mapped on DMA?</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_UP</name>
                  <description>TIM1_UP DMA requests mapped on DMA?</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH1</name>
                  <description>TIM2_CH1 DMA requests mapped on DMA?</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH2</name>
                  <description>TIM2_CH2 DMA requests mapped on DMA?</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH3</name>
                  <description>TIM2_CH3 DMA requests mapped on DMA?</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH4</name>
                  <description>TIM2_CH4 DMA requests mapped on DMA?</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_UP</name>
                  <description>TIM2_UP DMA requests mapped on DMA?</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_TRIG</name>
                  <description>TIM2_TRIG DMA requests mapped on DMA?</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH1</name>
                  <description>TIM3_CH1 DMA requests mapped on DMA?</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH2</name>
                  <description>TIM3_CH2 DMA requests mapped on DMA?</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH3</name>
                  <description>TIM3_CH3 DMA requests mapped on DMA?</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH4</name>
                  <description>TIM3_CH4 DMA requests mapped on DMA?</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_UP</name>
                  <description>TIM3_UP DMA requests mapped on DMA?</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_TRIG</name>
                  <description>TIM3_TRIG DMA requests mapped on DMA?</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM6_UP</name>
                  <description>TIM6_UP DMA requests mapped on DMA?</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM7_UP</name>
                  <description>TIM7_UP DMA requests mapped on DMA?</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_CH1</name>
                  <description>TIM15_CH1 DMA requests mapped on DMA?</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_CH2</name>
                  <description>TIM15_CH2 DMA requests mapped on DMA?</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_UP</name>
                  <description>TIM15_UP DMA requests mapped on DMA?</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_TRIG</name>
                  <description>TIM15_TRIG DMA requests mapped on DMA?</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_COM</name>
                  <description>TIM15_COM DMA requests mapped on DMA?</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_CH1</name>
                  <description>TIM16_CH1 DMA requests mapped on DMA?</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_UP</name>
                  <description>TIM16_UP DMA requests mapped on DMA?</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_CH1</name>
                  <description>TIM17_CH1 DMA requests mapped on DMA?</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_UP</name>
                  <description>TIM17_UP DMA requests mapped on DMA?</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD</name>
                  <description>LCD DMA requests mapped on DMA?</description>
                  <value>49</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>desc DMA2_MAP</description>
              <bitRange>[13:8]</bitRange>
              <enumeratedValues derivedFrom="DMA1_MAP"/>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>desc DMA3_MAP</description>
              <bitRange>[21:16]</bitRange>
              <enumeratedValues derivedFrom="DMA1_MAP"/>
            </field>
            <field>
              <name>DMA4_MAP</name>
              <description>desc DMA4_MAP</description>
              <bitRange>[29:24]</bitRange>
              <enumeratedValues derivedFrom="DMA1_MAP"/>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <description>desc CFGR4</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMA5_MAP</name>
              <description>desc DMA5_MAP</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <name>DMA5_MAP</name>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC DMA requests mapped on DMA?</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_TX</name>
                  <description>SPI1_TX DMA requests mapped on DMA?</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RX</name>
                  <description>SPI1_RX DMA requests mapped on DMA?</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_TX</name>
                  <description>SPI2_TX DMA requests mapped on DMA?</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI2_RX</name>
                  <description>SPI2_RX DMA requests mapped on DMA?</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_TX</name>
                  <description>USART1_TX DMA requests mapped on DMA?</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_RX</name>
                  <description>USART1_RX DMA requests mapped on DMA?</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_TX</name>
                  <description>USART2_TX DMA requests mapped on DMA?</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2_RX</name>
                  <description>USART2_RX DMA requests mapped on DMA?</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_TX</name>
                  <description>USART3_TX DMA requests mapped on DMA?</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART3_RX</name>
                  <description>USART3_RX DMA requests mapped on DMA?</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART4_TX</name>
                  <description>USART4_TX DMA requests mapped on DMA?</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART4_RX</name>
                  <description>USART4_RX DMA requests mapped on DMA?</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_TX</name>
                  <description>I2C1_TX DMA requests mapped on DMA?</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_RX</name>
                  <description>I2C1_RX DMA requests mapped on DMA?</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C2_TX</name>
                  <description>I2C2_TX DMA requests mapped on DMA?</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C2_RX</name>
                  <description>I2C2_RX DMA requests mapped on DMA?</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH1</name>
                  <description>TIM1_CH1 DMA requests mapped on DMA?</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH2</name>
                  <description>TIM1_CH2 DMA requests mapped on DMA?</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH3</name>
                  <description>TIM1_CH3 DMA requests mapped on DMA?</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_CH4</name>
                  <description>TIM1_CH4 DMA requests mapped on DMA?</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_COM</name>
                  <description>TIM1_COM DMA requests mapped on DMA?</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_TRIG</name>
                  <description>TIM1_TRIG DMA requests mapped on DMA?</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_UP</name>
                  <description>TIM1_UP DMA requests mapped on DMA?</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH1</name>
                  <description>TIM2_CH1 DMA requests mapped on DMA?</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH2</name>
                  <description>TIM2_CH2 DMA requests mapped on DMA?</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH3</name>
                  <description>TIM2_CH3 DMA requests mapped on DMA?</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_CH4</name>
                  <description>TIM2_CH4 DMA requests mapped on DMA?</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_UP</name>
                  <description>TIM2_UP DMA requests mapped on DMA?</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_TRIG</name>
                  <description>TIM2_TRIG DMA requests mapped on DMA?</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH1</name>
                  <description>TIM3_CH1 DMA requests mapped on DMA?</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH2</name>
                  <description>TIM3_CH2 DMA requests mapped on DMA?</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH3</name>
                  <description>TIM3_CH3 DMA requests mapped on DMA?</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_CH4</name>
                  <description>TIM3_CH4 DMA requests mapped on DMA?</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_UP</name>
                  <description>TIM3_UP DMA requests mapped on DMA?</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_TRIG</name>
                  <description>TIM3_TRIG DMA requests mapped on DMA?</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM6_UP</name>
                  <description>TIM6_UP DMA requests mapped on DMA?</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM7_UP</name>
                  <description>TIM7_UP DMA requests mapped on DMA?</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_CH1</name>
                  <description>TIM15_CH1 DMA requests mapped on DMA?</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_CH2</name>
                  <description>TIM15_CH2 DMA requests mapped on DMA?</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_UP</name>
                  <description>TIM15_UP DMA requests mapped on DMA?</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_TRIG</name>
                  <description>TIM15_TRIG DMA requests mapped on DMA?</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_COM</name>
                  <description>TIM15_COM DMA requests mapped on DMA?</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_CH1</name>
                  <description>TIM16_CH1 DMA requests mapped on DMA?</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM16_UP</name>
                  <description>TIM16_UP DMA requests mapped on DMA?</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_CH1</name>
                  <description>TIM17_CH1 DMA requests mapped on DMA?</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM17_UP</name>
                  <description>TIM17_UP DMA requests mapped on DMA?</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD</name>
                  <description>LCD DMA requests mapped on DMA?</description>
                  <value>49</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA6_MAP</name>
              <description>desc DMA6_MAP</description>
              <bitRange>[13:8]</bitRange>
              <enumeratedValues derivedFrom="DMA5_MAP"/>
            </field>
            <field>
              <name>DMA7_MAP</name>
              <description>desc DMA7_MAP</description>
              <bitRange>[21:16]</bitRange>
              <enumeratedValues derivedFrom="DMA5_MAP"/>
            </field>
          </fields>
        </register>
